const hospitals = [
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "คณะแพทยศาสตร์วชิรพยาบาล มหาวิทยาลัยนวมินทราธิราช",
        "latitude": 13.7808145,
        "longitude": 100.5086484
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "ทัณฑสถานโรงพยาบาลราชทัณฑ์",
        "latitude": 13.8504249,
        "longitude": 100.5533096
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลกลาง",
        "latitude": 13.7465459,
        "longitude": 100.5092822
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลจุฬาภรณ์",
        "latitude": 13.8813307,
        "longitude": 100.5784954
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลจุฬาลงกรณ์สภากาชาดไทย",
        "latitude": 13.7323844,
        "longitude": 100.5357643
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลเจริญกรุงประชารักษ์",
        "latitude": 13.6944514,
        "longitude": 100.4946298
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลตากสิน",
        "latitude": 13.7304755,
        "longitude": 100.5086438
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลตำรวจ",
        "latitude": 13.7426433,
        "longitude": 100.5385645
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลนคราภิบาล",
        "latitude": 13.7226011,
        "longitude": 100.7840688
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลนพรัตนราชธานี (สธ)",
        "latitude": 13.8157061,
        "longitude": 100.6880001
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลผู้สูงอายุบางขุนเทียน",
        "latitude": 13.573052,
        "longitude": 100.4233985
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระมงกุฎเกล้า",
        "latitude": 13.76773,
        "longitude": 100.534366
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลภูมิพลอดุลยเดช",
        "latitude": 13.9092514,
        "longitude": 100.6178965
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลราชพิพัฒน์",
        "latitude": 13.7305052,
        "longitude": 100.3669313
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลราชวิถี",
        "latitude": 13.7643024,
        "longitude": 100.5367956
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลรามาธิบดี มหาวิทยาลัยมหิดล",
        "latitude": 13.7660775,
        "longitude": 100.5267631
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลเลิดสิน (สธ)",
        "latitude": 13.7221964,
        "longitude": 100.5173902
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลเวชการุณย์รัศม์",
        "latitude": 13.8568125,
        "longitude": 100.8590321
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลศิริราช",
        "latitude": 13.7568186,
        "longitude": 100.4835109
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระปิ่นเกล้า (กห)",
        "latitude": 13.7101188,
        "longitude": 100.4868259
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลสิรินธร",
        "latitude": 13.7179812,
        "longitude": 100.707137
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลหลวงพ่อทวีศักดิ์ ชุตินธโร อุทิศ",
        "latitude": 13.6559905,
        "longitude": 100.3451606
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "นวมินทร์ 9 โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.8113417,
        "longitude": 100.7237556
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "นวมินทร์ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.8112195,
        "longitude": 100.7216146
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาล ไอเอ็มเอช ธนบุรี โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.6776854,
        "longitude": 100.4985685
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาล เอสเอ็มเอ สีลม โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.772884,
        "longitude": 100.6307296
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ บางแค โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.710611,
        "longitude": 100.3986326
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ รามคำแหง โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7796526,
        "longitude": 100.6763046
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ ประชาชื่น",
        "latitude": 13.8318577,
        "longitude": 100.5388777
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ บี.แคร์ เมดิคอลเซ็นเตอร์",
        "latitude": 13.9436441,
        "longitude": 100.6245672
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ เปาโล โชคชัย 4",
        "latitude": 13.8019068,
        "longitude": 100.596148
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ พีเอ็มจี",
        "latitude": 13.6516984,
        "longitude": 100.4220017
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ โรงพยาบาลมงกุฎวัฒนะ",
        "latitude": 13.8940314,
        "longitude": 100.5616764
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่กล้วยน้ำไท",
        "latitude": 13.7139515,
        "longitude": 100.5876303
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่บางนา 1",
        "latitude": 13.6668249,
        "longitude": 100.6355092
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่เปาโล เกษตร",
        "latitude": 13.8354167,
        "longitude": 100.5741868
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่แพทย์ปัญญา",
        "latitude": 13.7438941,
        "longitude": 100.6074312
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่มิตรประชา",
        "latitude": 13.7120791,
        "longitude": 100.4318653
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ราษฎร์บูรณะ",
        "latitude": 13.6778719,
        "longitude": 100.502859
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ลาดพร้าว",
        "latitude": 13.7674316,
        "longitude": 100.640667
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ศิครินทร์ กรุงเทพ",
        "latitude": 13.6547311,
        "longitude": 100.646385
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลบางปะกอก 8 โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.6631952,
        "longitude": 100.4069214
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลบางไผ่ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7250264,
        "longitude": 100.464846
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลบางมด โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.6717765,
        "longitude": 100.45648
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลพญาไท นวมินทร์ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.8252124,
        "longitude": 100.6575516
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลเพชรเวช โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7426983,
        "longitude": 100.5948406
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลมิชชั่น โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7578678,
        "longitude": 100.5194916
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลสุขสวัสดิ์อินเตอร์ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.6761127,
        "longitude": 100.5011043
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลหัวเฉียว โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7500823,
        "longitude": 100.5154121
    },
    {
        "province": "กรุงเทพมหานคร",
        "type": "เอกชน",
        "name": "วิภาราม โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7347131,
        "longitude": 100.6453885
    },
    {
        "province": "กระบี่",
        "type": "รัฐ",
        "name": "โรงพยาบาลกระบี่ (สธ)",
        "latitude": 8.0759762,
        "longitude": 98.9150023
    },
    {
        "province": "กาญจนบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายสุรสีห์",
        "latitude": 14.1051429,
        "longitude": 99.4256097
    },
    {
        "province": "กาญจนบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพหลพลพยุหเสนา (สธ)",
        "latitude": 14.0054791,
        "longitude": 99.5464707
    },
    {
        "province": "กาญจนบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลมะการักษ์ (สธ)",
        "latitude": 13.908217,
        "longitude": 99.76741
    },
    {
        "province": "กาฬสินธุ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลกาฬสินธุ์ (สธ)",
        "latitude": 16.4346649,
        "longitude": 103.5055873
    },
    {
        "province": "กำแพงเพชร",
        "type": "รัฐ",
        "name": "โรงพยาบาลกำแพงเพชร (สธ)",
        "latitude": 16.4630834,
        "longitude": 99.52841400000001
    },
    {
        "province": "ขอนแก่น",
        "type": "รัฐ",
        "name": "โรงพยาบาลขอนแก่น (สธ)",
        "latitude": 16.4291172,
        "longitude": 102.8491256
    },
    {
        "province": "ขอนแก่น",
        "type": "รัฐ",
        "name": "โรงพยาบาลชุมแพ (สธ)",
        "latitude": 16.5456353,
        "longitude": 102.0995812
    },
    {
        "province": "ขอนแก่น",
        "type": "รัฐ",
        "name": "โรงพยาบาลศรีนครินทร์ มหาวิทยาลัยขอนแก่น",
        "latitude": 16.4680574,
        "longitude": 102.8300541
    },
    {
        "province": "จันทบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระปกเกล้า (สธ)",
        "latitude": 12.6042716,
        "longitude": 102.1023517
    },
    {
        "province": "ฉะเชิงเทรา",
        "type": "รัฐ",
        "name": "โรงพยาบาลพุทธโสธร (สธ)",
        "latitude": 13.6860439,
        "longitude": 101.0737507
    },
    {
        "province": "ฉะเชิงเทรา",
        "type": "เอกชน",
        "name": "จุฬารัตน์ 11 อินเตอร์ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.5425523,
        "longitude": 100.9628266
    },
    {
        "province": "ฉะเชิงเทรา",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ ฉะเชิงเทรา โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.695453,
        "longitude": 101.0515177
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลชลบุรี (สธ)",
        "latitude": 13.3519862,
        "longitude": 100.9821733
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพนัสนิคม (สธ)",
        "latitude": 13.4599834,
        "longitude": 101.1724349
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพัทยาปัทมคุณ (สธ)",
        "latitude": 12.9665688,
        "longitude": 100.9061757
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาวิทยาลัยบูรพา",
        "latitude": 13.285218,
        "longitude": 100.922264
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลเมืองพัทยา (มท)",
        "latitude": 12.9278643,
        "longitude": 100.8844333
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระนางเจ้าสิริกิติ์ (กห)",
        "latitude": 12.6883094,
        "longitude": 100.9815633
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระบรมราชเทวี ณ ศรีราชา",
        "latitude": 13.1618315,
        "longitude": 100.9184756
    },
    {
        "province": "ชลบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลแหลมฉบัง (สธ)",
        "latitude": 13.1160314,
        "longitude": 100.9189939
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "ปิยะเวชช์ บ่อวิน โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 13.0628702,
        "longitude": 101.1026079
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลพญาไทศรีราชา 2 โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.1705846,
        "longitude": 100.9294747
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลพญาไทศรีราชา โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.1687737,
        "longitude": 100.9282067
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลพญาไท บ่อวิน โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 13.0424366,
        "longitude": 101.0873156
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "วิภาราม อมตะนคร โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.421037,
        "longitude": 101.002989
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลเอกชล อ่างศิลา โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.3176696,
        "longitude": 100.9487746
    },
    {
        "province": "ชลบุรี",
        "type": "เอกชน",
        "name": "วิภารามแหลมฉบัง โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.0877644,
        "longitude": 100.9179247
    },
    {
        "province": "ชัยนาท",
        "type": "รัฐ",
        "name": "โรงพยาบาลชัยนาทนเรนทร (สธ)",
        "latitude": 15.1917249,
        "longitude": 100.1275927
    },
    {
        "province": "ชัยภูมิ",
        "type": "รัฐ",
        "name": "โรงพยาบาลชัยภูมิ (สธ)",
        "latitude": 15.8060889,
        "longitude": 102.0347765
    },
    {
        "province": "ชุมพร",
        "type": "รัฐ",
        "name": "โรงพยาบาลชุมพรเขตรอุดมศักดิ์ (สธ)",
        "latitude": 10.4975184,
        "longitude": 99.1861941
    },
    {
        "province": "เชียงราย",
        "type": "รัฐ",
        "name": "โรงพยาบาลเชียงรายประชานุเคราะห์ (สธ)",
        "latitude": 19.9007759,
        "longitude": 99.8291876
    },
    {
        "province": "เชียงราย",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ศรีบุรินทร์",
        "latitude": 19.8781001,
        "longitude": 99.8355446
    },
    {
        "province": "เชียงราย",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดกลางเชียงราย ราม",
        "latitude": 19.8949972,
        "longitude": 99.8311744
    },
    {
        "province": "เชียงใหม่",
        "type": "รัฐ",
        "name": "โรงพยาบาลนครพิงค์ (สธ)",
        "latitude": 18.789788,
        "longitude": 99.004244
    },
    {
        "province": "เชียงใหม่",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาราชนครเชียงใหม่ มหาวิทยาลัยเชียงใหม่",
        "latitude": 18.7896261,
        "longitude": 98.9746184
    },
    {
        "province": "เชียงใหม่",
        "type": "รัฐ",
        "name": "โรงพยาบาลสันป่าตอง (สธ)",
        "latitude": 18.5956136,
        "longitude": 98.88532119999999
    },
    {
        "province": "เชียงใหม่",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ เชียงใหม่ใกล้หมอ",
        "latitude": 18.7885153,
        "longitude": 99.00167929999999
    },
    {
        "province": "เชียงใหม่",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่เทพปัญญา",
        "latitude": 18.8102472,
        "longitude": 99.0113466
    },
    {
        "province": "เชียงใหม่",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ราชเวชเชียงใหม่",
        "latitude": 18.7668981,
        "longitude": 99.00432049999999
    },
    {
        "province": "เชียงใหม่",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ลานนา 3",
        "latitude": 18.8155563,
        "longitude": 98.9940998
    },
    {
        "province": "เชียงใหม่",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ลานนา",
        "latitude": 18.8123878,
        "longitude": 98.99101139999999
    },
    {
        "province": "ตรัง",
        "type": "รัฐ",
        "name": "โรงพยาบาลตรัง (สธ)",
        "latitude": 7.572413900000001,
        "longitude": 99.62046889999999
    },
    {
        "province": "ตรัง",
        "type": "เอกชน",
        "name": "โรงพยาบาลธนบุรีตรัง โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 7.568524399999999,
        "longitude": 99.6195664
    },
    {
        "province": "ตราด",
        "type": "รัฐ",
        "name": "โรงพยาบาลตราด (สธ)",
        "latitude": 12.248056,
        "longitude": 102.5116209
    },
    {
        "province": "ตาก",
        "type": "รัฐ",
        "name": "โรงพยาบาลแม่สอด (สธ)",
        "latitude": 16.709782,
        "longitude": 98.57233199999999
    },
    {
        "province": "ตาก",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระเจ้าตากสินมหาราช (สธ)",
        "latitude": 16.8730199,
        "longitude": 99.131596
    },
    {
        "province": "ตาก",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่แม่สอด ราม",
        "latitude": 16.7109205,
        "longitude": 98.56404789999999
    },
    {
        "province": "นครนายก",
        "type": "รัฐ",
        "name": "โรงพยาบาลนครนายก (สธ)",
        "latitude": 14.2080302,
        "longitude": 101.2129337
    },
    {
        "province": "นครนายก",
        "type": "รัฐ",
        "name": "โรงพยาบาลศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดาฯ",
        "latitude": 14.1114901,
        "longitude": 100.9848908
    },
    {
        "province": "นครปฐม",
        "type": "รัฐ",
        "name": "โรงพยาบาลจันทรุเบกษา",
        "latitude": 14.1027787,
        "longitude": 99.9392182
    },
    {
        "province": "นครปฐม",
        "type": "รัฐ",
        "name": "โรงพยาบาลนครปฐม (สธ)",
        "latitude": 13.8191484,
        "longitude": 100.0751925
    },
    {
        "province": "นครปฐม",
        "type": "รัฐ",
        "name": "โรงพยาบาลเมตตาประชารักษ์(วัดไร่ขิง) (สธ)",
        "latitude": 13.7387171,
        "longitude": 100.2563542
    },
    {
        "province": "นครพนม",
        "type": "รัฐ",
        "name": "โรงพยาบาลนครพนม (สธ)",
        "latitude": 17.4138876,
        "longitude": 104.7773892
    },
    {
        "province": "นครราชสีมา",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายสุรนารี นครราชสีมา",
        "latitude": 14.9661843,
        "longitude": 102.0867506
    },
    {
        "province": "นครราชสีมา",
        "type": "รัฐ",
        "name": "โรงพยาบาลเทพรัตน์นครราชสีมา (สธ)",
        "latitude": 14.9247409,
        "longitude": 101.9652755
    },
    {
        "province": "นครราชสีมา",
        "type": "รัฐ",
        "name": "โรงพยาบาลปากช่องนานา (สธ)",
        "latitude": 14.6806741,
        "longitude": 101.4000776
    },
    {
        "province": "นครราชสีมา",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาวิทยาลัยเทคโนโลยีสุรนารี",
        "latitude": 14.8640939,
        "longitude": 102.0355109
    },
    {
        "province": "นครราชสีมา",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาราชนครราชสีมา (สธ)",
        "latitude": 14.9846923,
        "longitude": 102.1034119
    },
    {
        "province": "นครราชสีมา",
        "type": "เอกชน",
        "name": "โรงพยาบาลกรุงเทพปากช่อง โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 14.718258,
        "longitude": 101.431655
    },
    {
        "province": "นครราชสีมา",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ ป.แพทย์ 1",
        "latitude": 14.973961,
        "longitude": 102.1060961
    },
    {
        "province": "นครศรีธรรมราช",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายวชิราวุธ",
        "latitude": 8.4980356,
        "longitude": 99.95430089999999
    },
    {
        "province": "นครศรีธรรมราช",
        "type": "รัฐ",
        "name": "โรงพยาบาลท่าศาลา (สธ)",
        "latitude": 8.660730899999999,
        "longitude": 99.9228971
    },
    {
        "province": "นครศรีธรรมราช",
        "type": "รัฐ",
        "name": "โรงพยาบาลทุ่งสง (สธ)",
        "latitude": 8.1624419,
        "longitude": 99.6807166
    },
    {
        "province": "นครศรีธรรมราช",
        "type": "รัฐ",
        "name": "โรงพยาบาลศูนย์การแพทย์มหาวิทยาลัยวลัยลักษณ์",
        "latitude": 8.6422429,
        "longitude": 99.91309100000001
    },
    {
        "province": "นครศรีธรรมราช",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาราชนครศรีธรรมราช (สธ)",
        "latitude": 8.3900084,
        "longitude": 99.9714187
    },
    {
        "province": "นครศรีธรรมราช",
        "type": "รัฐ",
        "name": "โรงพยาบาลสิชล (สธ)",
        "latitude": 9.00792,
        "longitude": 99.90306799999999
    },
    {
        "province": "นครสวรรค์",
        "type": "รัฐ",
        "name": "โรงพยาบาลสวรรค์ประชารักษ์ แห่งใหม่ (สธ)",
        "latitude": 15.7068592,
        "longitude": 100.1384211
    },
    {
        "province": "นครสวรรค์",
        "type": "เอกชน",
        "name": "โรงพยาบาลร่มฉัตร โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 15.6997956,
        "longitude": 100.1336509
    },
    {
        "province": "นนทบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระนั่งเกล้า (สธ)",
        "latitude": 13.8653518,
        "longitude": 100.4813657
    },
    {
        "province": "นนทบุรี",
        "type": "รัฐ",
        "name": "ศูนย์การแพทย์ปัญญานันทภิกขุ ชลประทาน",
        "latitude": 13.9000288,
        "longitude": 100.502027
    },
    {
        "province": "นนทบุรี",
        "type": "รัฐ",
        "name": "สถาบันบำราศนราดูร (สธ)",
        "latitude": 13.8537638,
        "longitude": 100.5227505
    },
    {
        "province": "นนทบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลกรุงไทย โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.9129495,
        "longitude": 100.5092523
    },
    {
        "province": "นนทบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลกรุงไทย เวสเทิร์น โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.9272523,
        "longitude": 100.4081428
    },
    {
        "province": "นนทบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่เกษมราษฎร์ รัตนาธิเบศร์",
        "latitude": 13.8759146,
        "longitude": 100.4235118
    },
    {
        "province": "นนทบุรี",
        "type": "เอกชน",
        "name": "วิภารามปากเกร็ด โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.910178,
        "longitude": 100.4982839
    },
    {
        "province": "นราธิวาส",
        "type": "รัฐ",
        "name": "โรงพยาบาลนราธิวาสราชนครินทร์ (สธ)",
        "latitude": 6.4145173,
        "longitude": 101.8238271
    },
    {
        "province": "นราธิวาส",
        "type": "รัฐ",
        "name": "โรงพยาบาลสุไหงโก-ลก (สธ)",
        "latitude": 6.0271753,
        "longitude": 101.9707548
    },
    {
        "province": "นราธิวาส",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ราษฎร์นรา",
        "latitude": 6.410485899999999,
        "longitude": 101.8222433
    },
    {
        "province": "น่าน",
        "type": "รัฐ",
        "name": "โรงพยาบาลน่าน (สธ)",
        "latitude": 18.7943747,
        "longitude": 100.788303
    },
    {
        "province": "บึงกาฬ",
        "type": "รัฐ",
        "name": "โรงพยาบาลบึงกาฬ (สธ)",
        "latitude": 18.3630517,
        "longitude": 103.6521911
    },
    {
        "province": "บุรีรัมย์",
        "type": "รัฐ",
        "name": "โรงพยาบาลบุรีรัมย์ (สธ)",
        "latitude": 15.0056788,
        "longitude": 103.1007246
    },
    {
        "province": "บุรีรัมย์",
        "type": "รัฐ",
        "name": "โรงพยาบาลนางรอง (สธ)",
        "latitude": 14.6343802,
        "longitude": 102.7867977
    },
    {
        "province": "ปทุมธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลธรรมศาสตร์เฉลิมพระเกียรติ",
        "latitude": 14.0736707,
        "longitude": 100.6156713
    },
    {
        "province": "ปทุมธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลปทุมธานี (สธ)",
        "latitude": 14.020474,
        "longitude": 100.5233701
    },
    {
        "province": "ปทุมธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลราชวิถี 2 (รังสิต)",
        "latitude": 13.9751875,
        "longitude": 100.6188437
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลกรุงไทย นอร์ทเทิร์น โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.0472528,
        "longitude": 100.463928
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลกรุงไทย ปทุม โรงพยาบาลทั่วไปขนาดเล็ก",
        "latitude": 13.957679,
        "longitude": 100.527517
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ ปทุมธานี โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.1172222,
        "longitude": 100.6178566
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลปทุมเวช โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.9880321,
        "longitude": 100.6104507
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลแพทย์รังสิต โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.9631251,
        "longitude": 100.6217871
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลซีจีเอ ลำลูกกา โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.9693495,
        "longitude": 100.6387373
    },
    {
        "province": "ปทุมธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลภัทร-ธนบุรี โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.0488576,
        "longitude": 100.6179585
    },
    {
        "province": "ประจวบคีรีขันธ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลบางสะพาน (สธ)",
        "latitude": 11.223786,
        "longitude": 99.49672679999999
    },
    {
        "province": "ประจวบคีรีขันธ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายธนะรัชต์",
        "latitude": 12.4101098,
        "longitude": 99.92286639999999
    },
    {
        "province": "ประจวบคีรีขันธ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลประจวบคีรีขันธ์ (สธ)",
        "latitude": 11.8009757,
        "longitude": 99.79575050000001
    },
    {
        "province": "ประจวบคีรีขันธ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลหัวหิน (สธ)",
        "latitude": 12.6080685,
        "longitude": 99.9479176
    },
    {
        "province": "ปราจีนบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลกบินทร์บุรี (สธ)",
        "latitude": 13.9575753,
        "longitude": 101.7266016
    },
    {
        "province": "ปราจีนบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายจักรพงษ์",
        "latitude": 14.0737973,
        "longitude": 101.371845
    },
    {
        "province": "ปราจีนบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลเจ้าพระยาอภัยภูเบศร (สธ)",
        "latitude": 14.0543455,
        "longitude": 101.3957653
    },
    {
        "province": "ปราจีนบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ ปราจีนบุรี โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.8990979,
        "longitude": 101.5957656
    },
    {
        "province": "ปราจีนบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่จุฬารัตน์ 304 อินเตอร์",
        "latitude": 13.8970193,
        "longitude": 101.6050383
    },
    {
        "province": "ปัตตานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลปัตตานี (สธ)",
        "latitude": 6.8689243,
        "longitude": 101.2487972
    },
    {
        "province": "พระนครศรีอยุธยา",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระนครศรีอยุธยา (สธ)",
        "latitude": 14.3437123,
        "longitude": 100.5604679
    },
    {
        "province": "พระนครศรีอยุธยา",
        "type": "รัฐ",
        "name": "โรงพยาบาลเสนา (สธ)",
        "latitude": 14.321138,
        "longitude": 100.388113
    },
    {
        "province": "พระนครศรีอยุธยา",
        "type": "เอกชน",
        "name": "โรงพยาบาลการุญเวช อยุธยา โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.2115476,
        "longitude": 100.608053
    },
    {
        "province": "พระนครศรีอยุธยา",
        "type": "เอกชน",
        "name": "โรงพยาบาลราชธานี โรจนะ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.2999999,
        "longitude": 100.6553859
    },
    {
        "province": "พระนครศรีอยุธยา",
        "type": "เอกชน",
        "name": "โรงพยาบาลราชธานี โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.3429693,
        "longitude": 100.608986
    },
    {
        "province": "พะเยา",
        "type": "รัฐ",
        "name": "โรงพยาบาลพะเยา (สธ)",
        "latitude": 19.1910684,
        "longitude": 99.8773951
    },
    {
        "province": "พะเยา",
        "type": "รัฐ",
        "name": "โรงพยาบาลเชียงคำ (สธ)",
        "latitude": 19.5185887,
        "longitude": 100.2961361
    },
    {
        "province": "พะเยา",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาวิทยาลัยพะเยา",
        "latitude": 19.0323876,
        "longitude": 99.9199278
    },
    {
        "province": "พังงา",
        "type": "รัฐ",
        "name": "โรงพยาบาลตะกั่วป่า (สธ)",
        "latitude": 8.8638661,
        "longitude": 98.3338196
    },
    {
        "province": "พังงา",
        "type": "รัฐ",
        "name": "โรงพยาบาลพังงา (สธ)",
        "latitude": 8.44861,
        "longitude": 98.52642589999999
    },
    {
        "province": "พัทลุง",
        "type": "รัฐ",
        "name": "โรงพยาบาลพัทลุง (สธ)",
        "latitude": 7.614924999999999,
        "longitude": 100.0736089
    },
    {
        "province": "พิจิตร",
        "type": "รัฐ",
        "name": "โรงพยาบาลพิจิตร (สธ)",
        "latitude": 16.4350085,
        "longitude": 100.3448289
    },
    {
        "province": "พิษณุโลก",
        "type": "รัฐ",
        "name": "โรงพยาบาลพุทธชินราช (สธ)",
        "latitude": 16.8087979,
        "longitude": 100.2635137
    },
    {
        "province": "พิษณุโลก",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายสมเด็จพระนเรศวร",
        "latitude": 16.8255631,
        "longitude": 100.253634
    },
    {
        "province": "พิษณุโลก",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาวิทยาลัยนเรศวร",
        "latitude": 16.7487985,
        "longitude": 100.1890293
    },
    {
        "province": "พิษณุโลก",
        "type": "เอกชน",
        "name": "โรงพยาบาลพิษณุโลกฮอสพิทอล โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 16.8056604,
        "longitude": 100.2552002
    },
    {
        "province": "เพชรบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระจอมเกล้า (สธ)",
        "latitude": 13.1180938,
        "longitude": 99.938322
    },
    {
        "province": "เพชรบูรณ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลเพชรบูรณ์ (สธ)",
        "latitude": 16.4272651,
        "longitude": 101.1534343
    },
    {
        "province": "แพร่",
        "type": "รัฐ",
        "name": "โรงพยาบาลแพร่ (สธ)",
        "latitude": 18.1339366,
        "longitude": 100.154381
    },
    {
        "province": "ภูเก็ต",
        "type": "รัฐ",
        "name": "โรงพยาบาลวชิระภูเก็ต (สธ)",
        "latitude": 7.8967544,
        "longitude": 98.3838207
    },
    {
        "province": "ภูเก็ต",
        "type": "รัฐ",
        "name": "โรงพยาบาลป่าตอง (สธ)",
        "latitude": 7.895942499999999,
        "longitude": 98.30146839999999
    },
    {
        "province": "ภูเก็ต",
        "type": "รัฐ",
        "name": "โรงพยาบาลองค์การบริหารส่วนจังหวัดภูเก็ต",
        "latitude": 7.881066000000001,
        "longitude": 98.404991
    },
    {
        "province": "ภูเก็ต",
        "type": "เอกชน",
        "name": "โรงพยาบาลมิชชั่นภูเก็ต โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 7.906812500000001,
        "longitude": 98.3908125
    },
    {
        "province": "ภูเก็ต",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดกลางดีบุก",
        "latitude": 7.871874099999999,
        "longitude": 98.36041829999999
    },
    {
        "province": "มหาสารคาม",
        "type": "รัฐ",
        "name": "โรงพยาบาลมหาสารคาม (สธ)",
        "latitude": 16.1811672,
        "longitude": 103.2992188
    },
    {
        "province": "มหาสารคาม",
        "type": "รัฐ",
        "name": "โรงพยาบาลสุทธาเวช คณะแพทยศาสตร์ มหาวิทยาลัยมหาสารคาม",
        "latitude": 16.1994897,
        "longitude": 103.2851903
    },
    {
        "province": "มุกดาหาร",
        "type": "รัฐ",
        "name": "โรงพยาบาลมุกดาหาร (สธ)",
        "latitude": 16.5418353,
        "longitude": 104.7268926
    },
    {
        "province": "แม่ฮ่องสอน",
        "type": "รัฐ",
        "name": "โรงพยาบาลศรีสังวาลย์ (สธ)",
        "latitude": 19.2997442,
        "longitude": 97.97186549999999
    },
    {
        "province": "ยโสธร",
        "type": "รัฐ",
        "name": "โรงพยาบาลยโสธร (สธ)",
        "latitude": 15.7812822,
        "longitude": 104.1615272
    },
    {
        "province": "ยะลา",
        "type": "รัฐ",
        "name": "โรงพยาบาลเบตง (สธ)",
        "latitude": 5.773554,
        "longitude": 101.0821969
    },
    {
        "province": "ยะลา",
        "type": "รัฐ",
        "name": "โรงพยาบาลยะลา (สธ)",
        "latitude": 6.5476549,
        "longitude": 101.2765045
    },
    {
        "province": "ร้อยเอ็ด",
        "type": "รัฐ",
        "name": "โรงพยาบาลร้อยเอ็ด (สธ)",
        "latitude": 16.0476019,
        "longitude": 103.6524306
    },
    {
        "province": "ระนอง",
        "type": "รัฐ",
        "name": "โรงพยาบาลระนอง (สธ)",
        "latitude": 9.9635959,
        "longitude": 98.6429187
    },
    {
        "province": "ระยอง",
        "type": "รัฐ",
        "name": "โรงพยาบาลเฉลิมพระเกียรติสมเด็จพระเทพรัตนราชสุดาฯ (สธ)",
        "latitude": 12.7305694,
        "longitude": 101.1364029
    },
    {
        "province": "ระยอง",
        "type": "รัฐ",
        "name": "โรงพยาบาลระยอง (สธ)",
        "latitude": 12.6821032,
        "longitude": 101.2764781
    },
    {
        "province": "ระยอง",
        "type": "เอกชน",
        "name": "โรงพยาบาลกรุงเทพปลวกแดง โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 12.9785617,
        "longitude": 101.1967419
    },
    {
        "province": "ระยอง",
        "type": "เอกชน",
        "name": "ปิยะเวชช์ ระยอง โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 12.9887275,
        "longitude": 101.1365593
    },
    {
        "province": "ระยอง",
        "type": "เอกชน",
        "name": "โรงพยาบาลจุฬารัตน์ระยอง โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 12.6852329,
        "longitude": 101.2745722
    },
    {
        "province": "ระยอง",
        "type": "เอกชน",
        "name": "โรงพยาบาลมงกุฎระยอง โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 12.7331929,
        "longitude": 101.1577706
    },
    {
        "province": "ราชบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลบ้านโป่ง (สธ)",
        "latitude": 13.8172519,
        "longitude": 99.87095529999999
    },
    {
        "province": "ราชบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลดำเนินสะดวก (สธ)",
        "latitude": 13.5365157,
        "longitude": 99.965853
    },
    {
        "province": "ราชบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลโพธาราม (สธ)",
        "latitude": 13.6946009,
        "longitude": 99.8516861
    },
    {
        "province": "ราชบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลราชบุรี (สธ)",
        "latitude": 13.5309561,
        "longitude": 99.81551139999999
    },
    {
        "province": "ราชบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลซานคามิลโล โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.810396,
        "longitude": 99.8793049
    },
    {
        "province": "ลพบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลบ้านหมี่ (สธ)",
        "latitude": 15.0441789,
        "longitude": 100.5419625
    },
    {
        "province": "ลพบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระนารายณ์มหาราช (สธ)",
        "latitude": 14.8049099,
        "longitude": 100.6525809
    },
    {
        "province": "ลพบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลอานันทมหิดล",
        "latitude": 14.8491606,
        "longitude": 100.6651011
    },
    {
        "province": "ลำปาง",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายสุรศักดิ์มนตรี (กห)",
        "latitude": 18.2948244,
        "longitude": 99.5191083
    },
    {
        "province": "ลำปาง",
        "type": "รัฐ",
        "name": "โรงพยาบาลลำปาง (สธ)",
        "latitude": 18.2869216,
        "longitude": 99.50597979999999
    },
    {
        "province": "ลำพูน",
        "type": "รัฐ",
        "name": "โรงพยาบาลลำพูน (สธ)",
        "latitude": 18.5827899,
        "longitude": 98.9950659
    },
    {
        "province": "ลำพูน",
        "type": "เอกชน",
        "name": "พริ้นซ์ ลำพูน โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 18.5630387,
        "longitude": 99.0359934
    },
    {
        "province": "ลำพูน",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดกลางลำพูนใกล้หมอ",
        "latitude": 18.5827899,
        "longitude": 98.9950659
    },
    {
        "province": "ลำพูน",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่หริภุญชัย เมโมเรียล",
        "latitude": 18.573606,
        "longitude": 99.004915
    },
    {
        "province": "เลย",
        "type": "รัฐ",
        "name": "โรงพยาบาลเลย (สธ)",
        "latitude": 17.487661,
        "longitude": 101.7226133
    },
    {
        "province": "ศรีสะเกษ",
        "type": "รัฐ",
        "name": "โรงพยาบาลศรีสะเกษ (สธ)",
        "latitude": 15.1161149,
        "longitude": 104.3201394
    },
    {
        "province": "สกลนคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลสกลนคร (สธ)",
        "latitude": 17.1633998,
        "longitude": 104.1582096
    },
    {
        "province": "สกลนคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระยุพราชสว่างแดนดิน (สธ)",
        "latitude": 17.47724,
        "longitude": 103.4579026
    },
    {
        "province": "สงขลา",
        "type": "รัฐ",
        "name": "โรงพยาบาลสงขลา (สธ)",
        "latitude": 7.1421701,
        "longitude": 100.5664011
    },
    {
        "province": "สงขลา",
        "type": "รัฐ",
        "name": "โรงพยาบาลสงขลานครินทร์",
        "latitude": 7.006915,
        "longitude": 100.4944626
    },
    {
        "province": "สงขลา",
        "type": "รัฐ",
        "name": "โรงพยาบาลหาดใหญ่ (สธ)",
        "latitude": 7.0167471,
        "longitude": 100.4674982
    },
    {
        "province": "สงขลา",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ ศิครินทร์ หาดใหญ่",
        "latitude": 7.022423,
        "longitude": 100.4697785
    },
    {
        "province": "สตูล",
        "type": "รัฐ",
        "name": "โรงพยาบาลสตูล (สธ)",
        "latitude": 6.617899599999999,
        "longitude": 100.0711185
    },
    {
        "province": "สมุทรปราการ",
        "type": "รัฐ",
        "name": "โรงพยาบาลบางบ่อ (สธ)",
        "latitude": 13.56966,
        "longitude": 100.835684
    },
    {
        "province": "สมุทรปราการ",
        "type": "รัฐ",
        "name": "โรงพยาบาลบางพลี (สธ)",
        "latitude": 13.6038432,
        "longitude": 100.7061069
    },
    {
        "province": "สมุทรปราการ",
        "type": "รัฐ",
        "name": "โรงพยาบาลรามาธิบดีจักรีนฤบดินทร์",
        "latitude": 13.52597,
        "longitude": 100.7610614
    },
    {
        "province": "สมุทรปราการ",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมุทรปราการ (สธ)",
        "latitude": 13.583728,
        "longitude": 100.5973519
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลขนาดใหญ่จุฬารัตน์ 3 อินเตอร์",
        "latitude": 13.5998401,
        "longitude": 100.7212443
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่จุฬารัตน์ 9 แอร์พอร์ต",
        "latitude": 13.677462,
        "longitude": 100.7225039
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่เซ็นทรัล ปาร์ค",
        "latitude": 13.6155781,
        "longitude": 100.7440668
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่บางนา 2",
        "latitude": 13.5940439,
        "longitude": 100.8049758
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่บางนา 5",
        "latitude": 13.6063793,
        "longitude": 100.6880253
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่เปาโล สมุทรปราการ",
        "latitude": 13.5983245,
        "longitude": 100.6145122
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่รวมชัยประชารักษ์",
        "latitude": 13.5836394,
        "longitude": 100.8541589
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่ศิครินทร์ สมุทรปราการ",
        "latitude": 13.5316243,
        "longitude": 100.6310251
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่สำโรงการแพทย์",
        "latitude": 13.6505089,
        "longitude": 100.5940993
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลบางปะกอก 3 โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.6343027,
        "longitude": 100.528285
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลเปาโล พระประแดง โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 13.6084608,
        "longitude": 100.5514274
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลเมืองสมุทรปากน้ำ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.5951855,
        "longitude": 100.601198
    },
    {
        "province": "สมุทรปราการ",
        "type": "เอกชน",
        "name": "โรงพยาบาลเมืองสมุทรปู่เจ้าฯ โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.6466956,
        "longitude": 100.5783807
    },
    {
        "province": "สมุทรสงคราม",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระพุทธเลิศหล้า (สธ)",
        "latitude": 13.4062425,
        "longitude": 99.9980347
    },
    {
        "province": "สมุทรสาคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลกระทุ่มแบน (สธ)",
        "latitude": 13.654412,
        "longitude": 100.255064
    },
    {
        "province": "สมุทรสาคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลบ้านแพ้ว",
        "latitude": 13.5904296,
        "longitude": 100.1047494
    },
    {
        "province": "สมุทรสาคร",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมุทรสาคร (สธ)",
        "latitude": 13.5531654,
        "longitude": 100.2785698
    },
    {
        "province": "สมุทรสาคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่วิชัยเวชฯ สมุทรสาคร",
        "latitude": 13.5757647,
        "longitude": 100.2719024
    },
    {
        "province": "สมุทรสาคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลทั่วไปขนาดใหญ่วิชัยเวชฯ อ้อมน้อย",
        "latitude": 13.7106846,
        "longitude": 100.2915187
    },
    {
        "province": "สมุทรสาคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลมหาชัย 2 โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.7073935,
        "longitude": 100.3011521
    },
    {
        "province": "สมุทรสาคร",
        "type": "เอกชน",
        "name": "โรงพยาบาลมหาชัย 3 โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.5566692,
        "longitude": 100.2720623
    },
    {
        "province": "สมุทรสาคร",
        "type": "เอกชน",
        "name": "วิภาราม สมุทรสาคร โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 13.5388032,
        "longitude": 100.229287
    },
    {
        "province": "สระแก้ว",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระยุพราชสระแก้ว (สธ)",
        "latitude": 13.8168071,
        "longitude": 102.0722736
    },
    {
        "province": "สระบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลพระพุทธบาท (สธ)",
        "latitude": 14.7243162,
        "longitude": 100.801937
    },
    {
        "province": "สระบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสระบุรี (สธ)",
        "latitude": 14.5341609,
        "longitude": 100.9157958
    },
    {
        "province": "สระบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลเกษมราษฎร์ สระบุรี โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.5238673,
        "longitude": 100.9331322
    },
    {
        "province": "สระบุรี",
        "type": "เอกชน",
        "name": "โรงพยาบาลราชธานี หนองแค โรงพยาบาลทั่วไปขนาดใหญ่",
        "latitude": 14.4094709,
        "longitude": 100.850132
    },
    {
        "province": "สิงห์บุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสิงห์บุรี (สธ)",
        "latitude": 14.8967085,
        "longitude": 100.3976201
    },
    {
        "province": "สิงห์บุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลอินทร์บุรี (สธ)",
        "latitude": 14.9882313,
        "longitude": 100.334323
    },
    {
        "province": "สุโขทัย",
        "type": "รัฐ",
        "name": "โรงพยาบาลศรีสังวรสุโขทัย (สธ)",
        "latitude": 17.1662015,
        "longitude": 99.86509799999999
    },
    {
        "province": "สุโขทัย",
        "type": "รัฐ",
        "name": "โรงพยาบาลสุโขทัย (สธ)",
        "latitude": 17.0108475,
        "longitude": 99.7960459
    },
    {
        "province": "สุพรรณบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลเจ้าพระยายมราช (สธ)",
        "latitude": 14.4665543,
        "longitude": 100.1160747
    },
    {
        "province": "สุพรรณบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระสังฆราชองค์ที่ 17 (สธ)",
        "latitude": 14.225216,
        "longitude": 100.0279701
    },
    {
        "province": "สุพรรณบุรี",
        "type": "รัฐ",
        "name": "โรงพยาบาลอู่ทอง (สธ)",
        "latitude": 14.3491649,
        "longitude": 99.87218980000002
    },
    {
        "province": "สุราษฎร์ธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลกาญจนดิษฐ์ (สธ)",
        "latitude": 9.1614985,
        "longitude": 99.4928772
    },
    {
        "province": "สุราษฎร์ธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลเกาะสมุย (สธ)",
        "latitude": 9.521826299999999,
        "longitude": 99.935496
    },
    {
        "province": "สุราษฎร์ธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสุราษฎร์ธานี (สธ)",
        "latitude": 9.1237537,
        "longitude": 99.31000069999999
    },
    {
        "province": "สุราษฎร์ธานี",
        "type": "เอกชน",
        "name": "โรงพยาบาลวัฒนแพทย์ สมุย โรงพยาบาลทั่วไปขนาดกลาง",
        "latitude": 9.5120168,
        "longitude": 100.0135929
    },
    {
        "province": "สุรินทร์",
        "type": "รัฐ",
        "name": "โรงพยาบาลสุรินทร์ (สธ)",
        "latitude": 14.8765646,
        "longitude": 103.5027463
    },
    {
        "province": "หนองคาย",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระยุพราชท่าบ่อ (สธ)",
        "latitude": 17.8476427,
        "longitude": 102.5766152
    },
    {
        "province": "หนองคาย",
        "type": "รัฐ",
        "name": "โรงพยาบาลหนองคาย (สธ)",
        "latitude": 17.8815416,
        "longitude": 102.7415855
    },
    {
        "province": "หนองบัวลำภู",
        "type": "รัฐ",
        "name": "โรงพยาบาลหนองบัวลำภู (สธ)",
        "latitude": 17.1988785,
        "longitude": 102.4573085
    },
    {
        "province": "อ่างทอง",
        "type": "รัฐ",
        "name": "โรงพยาบาลอ่างทอง (สธ)",
        "latitude": 14.584759,
        "longitude": 100.4521518
    },
    {
        "province": "อำนาจเจริญ",
        "type": "รัฐ",
        "name": "โรงพยาบาลอำนาจเจริญ (สธ)",
        "latitude": 15.863905,
        "longitude": 104.6238505
    },
    {
        "province": "อุดรธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลกุมภวาปี (สธ)",
        "latitude": 17.1046596,
        "longitude": 103.0210586
    },
    {
        "province": "อุดรธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายประจักษ์ศิลปาคม",
        "latitude": 17.3699643,
        "longitude": 102.8118553
    },
    {
        "province": "อุดรธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระยุพราชบ้านดุง (สธ)",
        "latitude": 17.6915901,
        "longitude": 103.2587727
    },
    {
        "province": "อุดรธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลอุดรธานี (สธ)",
        "latitude": 17.4148709,
        "longitude": 102.7804229
    },
    {
        "province": "อุตรดิตถ์",
        "type": "รัฐ",
        "name": "โรงพยาบาลอุตรดิตถ์ (สธ)",
        "latitude": 17.6191351,
        "longitude": 100.0869882
    },
    {
        "province": "อุทัยธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลอุทัยธานี (สธ)",
        "latitude": 15.3803419,
        "longitude": 100.0199671
    },
    {
        "province": "อุบลราชธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลค่ายสรรพสิทธิประสงค์",
        "latitude": 15.1937294,
        "longitude": 104.8750159
    },
    {
        "province": "อุบลราชธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลวารินชำราบ (สธ)",
        "latitude": 15.1937575,
        "longitude": 104.8380668
    },
    {
        "province": "อุบลราชธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสมเด็จพระยุพราชเดชอุดม (สธ)",
        "latitude": 14.9158526,
        "longitude": 105.0612916
    },
    {
        "province": "อุบลราชธานี",
        "type": "รัฐ",
        "name": "โรงพยาบาลสรรพสิทธิประสงค์ (สธ)",
        "latitude": 15.2360899,
        "longitude": 104.8654529
    }
];
const dataLastUpdated = new Date('2026-01-31');
